stariron_backend/app/controllers/favorites_controller.rb

  def index
    favorites = Favorite.all
---
SELECT "favorites".* FROM "favorites"

  def destroy
    favorite = Favorite.find(params[:id])
    favorite.destroy!
---
SELECT "favorites".* FROM "favorites" WHERE "favorites"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = $1  [["id", 2]]