stariron_backend/app/controllers/sign_object_controller.rb

SELECT "sign_objects".* FROM "sign_objects"
---
  def index
    sign_objects = SignObject.all

INSERT INTO "sign_objects" ("description", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["description", "This is a test"], ["created_at", "2020-08-17 14:33:37.399459"], ["updated_at", "2020-08-17 14:33:37.399459"]]
---
  def create
    sign_object = SignObject.create!(sign_object_params)

SELECT "sign_objects".* FROM "sign_objects" WHERE "sign_objects"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
  def show
    sign_object = SignObject.find(params[:id])

SELECT "sign_objects".* FROM "sign_objects" WHERE "sign_objects"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def update
    sign_object = SignObject.find(params[:id])

SELECT "sign_objects".* FROM "sign_objects" WHERE "sign_objects"."id" = $1 LIMIT $2  [["id", 10], ["LIMIT", 1]]
DELETE FROM "sign_objects" WHERE "sign_objects"."id" = $1  [["id", 10]]
---
  def destroy
    sign_object = SignObject.find(params[:id])
    puts sign_object
    sign_object.destroy!