stariron_backend/app/controllers/users_controller.rb

  def create
    user = User.create(user_params)
---
INSERT INTO "users" ("name", "birthday", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["name", "Test_User1"], ["birthday", "2015-12-08"], ["created_at", "2020-08-18 17:40:29.584303"], ["updated_at", "2020-08-18 17:40:29.584303"]]

  def update
    user = User.find_by(params[:id])
    user.update!(user_params)
---
UPDATE "users" SET "name" = $1, "birthday" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["name", "Ben Garlock"], ["birthday", "1983-05-02"], ["updated_at", "2020-08-18 17:47:08.943521"], ["id", 1]]